"""
Описание: Исследую ООП и работу с классами.
Дата: 13 июля 2024 года
Автор: Евгений Петров
Почта: p174@mail.ru
Сайт урока:  https://www.youtube.com/watch?v=-Zdu4ntX_DU&list=PLNi5HdK6QEmX9fxp3_IBFx1O5tiTmKlYm&index=2
Объект - единица информации в памяти
Класс - инструкция по созданию объектов определенного типа
Экземпляр - конкретный объект какого-то класса
Метод - функция в классе для воздействия на объект
"""


# Создаю класс Purse
class Purse:
    pass


# Объявляю экземпляр класса
x = Purse()

# Посмотрим, что получилось: <class '__main__.Purse'>
print(type(x))
